from django.shortcuts import redirect, render
from django.http import HttpRequest
from django.urls import reverse


def home_page(request: HttpRequest):

    return render(request, "index.html")


def mode_light(request: HttpRequest):

    response = redirect("main:home_page")
    response.set_cookie("mode", "False")

    return response


def mode_dark(request: HttpRequest):
    response = redirect("main:home_page")
    response.set_cookie("mode", "True")

    return response


def business_economy_page(request: HttpRequest):
    cards = [
        {
            "name": "الإستراتيجية الوطنية للتقنية الحيوية",
            "image": ["DNA.jpg", "biotech-side.png"],
            "description":
            '''
            تعزيزًا لمكانة المملكة كدولة رائدة في قطاع التقنية الحيوية، تجسد الاستراتيجية الوطنية للتقنية الحيوية،
            وتتسع آفاقها لتعبّر عن بداية رحلةٍ تحوليةٍ للمملكة وللعالم. 
            تستهدف الاستراتيجية أن تصبح المملكة تجمعاً عالمياً رائداً في مجال التقنية الحيوية،
            إلى جانب تحقيق مستوى عالٍ من الاكتفاء الذاتي وإحداث أثر اجتماعي واقتصادي إيجابي.
            ''',
            "url": reverse("main:nb_strategy"),
        },

        {
            "name": "نيوم",
            "image": ["neom_desktop-1.png"],
            "description": "في عام 2017 أطلق صاحب السمو الملكي الأمير محمد بن سلمان بن عبدالعزيز ولي العهد رئيس مجلس الوزراء مشروع نيوم الجريء الذي يقوده صندوق الاستثمارات العامة، ليحول الصحراء إلى مدينة مستقبلية مبتكرة في شمال غرب المملكة، تعمل بنسبة 100% بالطاقة المتجددة، لتكون نموذجًا جديدًا للحياة المستدامة والعمل والازدهار، حيث يمكن البشرية من التقدم دون المساس بصحة كوكب الأرض.",
            "url": reverse("main:neom_page"),
        },

        {
            "name": "أوكساجون",
            "image": ["oxagon.png"],
            "description": '''هي المدينة الساحلية الصناعية العائمة في نيوم، التي ستربطكم مباشرة بالأسواق العالمية.
            \nتبني أوكساچون منظومة صناعية متقدمة ونظيفة تراعي مبادئ الحفاظ على البيئة، وتسرّع التحول إلى الثورة الصناعية الرابعة ومبادئ الاقتصاد الدائري. أوكساچون هي فرصة جديدة تُبنى من الصفر لتغيير مفهوم المدن الصناعية التقليدية، وإنشاء نموذج جديد يتمحور حول الإنسان والابتكار و الاستدامة.''',
            "url": reverse("main:oxagon_page"),
        },

        {
            "name": "الاستراتيجية الوطنية للاستثمار",
            "image": ["kafd.png"],
            "description": '''
                تنمي الاستراتيجية الوطنية للاستثمار البيئة التنافسية السعودية وتصنع مستقبلًا أكثر إشراقًا للقطاعات الحيوية.
                   \n تسهم الاستراتيجية الوطنية للاستثمار التي أطلقها صاحب السمو الملكي الأمير محمد بن سلمان بن عبدالعزيز ولي العهد ورئيس مجلس الوزراء في دفع عجلة التنمية وتنويع الاقتصاد المحلي، حيث تستهدف زيادة مساهمة القطاع الخاص في الناتج المحلي الإجمالي، وجذب المزيد من الاستثمارات الأجنبية، وزيادة الصادرات غير النفطية، وتقليل البطالة، وتعزيز تصنيف المملكة بين أفضل عشرة اقتصادات في مؤشر التنافسية العالمية بحلول عام 2030.''',
            "url": reverse("main:investment_page"),
        },

        {
            "name": "صنع في السعودية",
            "image": ["saudi-contaner.png"],
            "description": '''
            يحفز برنامج "صنع في السعودية" الشركات المحلية على توسيع نطاق أعمالها، والاستفادة من مزايا البرنامج لتسويق منتجاتها إلى عدد أكبر من العملاء، والتواصل مع المستهلكين المهتمين بالمنتجات والشركات السعودية.
            ''',
            "url": reverse("main:made_in_saudi_page"),
        },
    ]

    context = {"cards": cards}

    return render(request, "business-economy.html", context)


def national_biotechnology_strategy(request: HttpRequest):
    items = [
        {
            "img": "vaccine.png",
            "name": "1\n\nاللقاحات",
            "description":
            '''      
            تُعزز التقنية من إمكانيات التصنيع المتكاملة للقاحات،
             التي تسهم في تحقيق مستويات عالية من الاكتفاء الذاتي،
              إلى جانب تطوير فرص تفتح مجالًا أوسع للتصدير إلى منطقة الشرق الأوسط وشمال أفريقيا،
              وتمكين جهود البحث والتطوير باستخدام أحدث التقنيات المبتكرة؛
              لتُصبح المملكة مركزًا رائدًا في مجال التطوير النهائي للقاحات في المنطقة.
            ''',
        },
        {
            "img": "make.png",
            "name": "2\n\nالتصنيع الحيوي والتوطين",
            "description":
            '''
            تُمكّن التقنية من تحقيق كفاءة الإنفاق في الرعاية الصحية،
              بإنشاء منصة متكاملة للتصنيع الحيوي على المستوى المحلي؛
              بهدف الوصول إلى الاكتفاء الذاتي في إنتاج المستحضرات والمتشابهات الحيوية،
                وسيوفر ذلك فرصًا في لزيادة الصادرات النوعية، وتمكين نمو قطاع التقنية الحيوية.
            ''',
        },
        {
            "img": "genome.png",
            "name": "3\n\nالجينوم",
            "description":
            ''' 
                تُؤسس التقنية قاعدة معرفية لفهم الجينوم المحلي،
                  وتحفيز سبل الوقاية الصحية، وتعزيز الابتكار،
                    وذلك بتوسيع قاعدة بيانات الجينوم الوطنية ومنصة التحليلات،
                    وتطوير السياسات الداعمة التي تُيسّر الوصول إلى البيانات،
                    والاستفادة من هذا العلم في قطاع الرعاية الصحية؛
                    للحصول على تشخيصات دقيقة وفعالة.
            ''',
        },
        {
            "img": "plants.png",
            "name": "تحسين زراعة النباتات",
            "description":
            '''      
            تُحقق التقنية الاستدامة في الإمدادات الغذائية، بتحفيز الإنتاج الزراعي المحلي
              الذي يُحقق أثرًا إيجابيًا بتخفيض الواردات الزراعية بما فائضًا على ميزان المدفوعات،
                إلى جانب تعزيز الممارسات الخضراء التي تُسهم في استدامة البيئة.
            ''',
        },
    ]
    context = {"items": items}
    return render(request, "nb_strategy.html", context)


def neom_page(request: HttpRequest):
    items = [
        {
            "description":
            '''       تنمية وتنويع الاقتصاد للمملكة، ووضعها على خريطة الريادة العالمية في التنمية والتطوير
            ''',
        },
        {
            "description":
            '''   
                أن تكون نيوم وجهة للمعيشة والعمل للعالم، تتبنى ثقافة الاستكشاف والمغامرة 
            ''',
        },
        {
            "description":
            ''' 
                تبني نموذج جديد للاستدامة
            ''',
        },
        {
            "description":
            '''     
                إنشاء معايير جديدة لصحة المجتمع وحماية البيئة  
            ''',
        },
    ]

    context = {"items": items}
    return render(request, "neom.html", context)


def oxagon_page(request: HttpRequest):
    cards = [
        {
            "img": "windmill",
            "name": "وجهة القطاعات المتقدمة والنظيفة",
            "description":
            '''      
                ستكون أوكساچون بوابة 
                القطاعات والصناعات المتقدمة والنظيفة في نيوم،
                  حيث سنتبنى منهجيات غير مسبوقة بأعلى المستويات العالمية
                  لتمكين مصانع المستقبل من تصنيع منتجات المستقبل.
                  سنبني منظومة صناعية متكاملة تقدم الدعم للشركات والأعمال
                  في رحلتهم التصنيعية بأحدث التقنيات وأكثرها تقدماً.
            ''',
        },
        {
            "img": "dna",
            "name": "البحث والابتكار",
            "description":
            '''      
                نبني منظومة تضم المبتكرين ورواد الأعمال وتمكنهم من تطبيق الأفكار،
                  ونقلها من مرحلة التجريب في المختبرات إلى الأسواق، وسط مجتمع رقمي متطور ومتعاون.
                    وستقدم منظومة البحث والابتكار مرافق حديثة، تمكن
                    المبتكرين في رحلتهم الممتدة من الفكرة إلى التسويق،
                    عبر مرافق حديثة، لدعم روّاد الأعمال، وتطور المشاريع،
                    والتصنيع، وبمساعدة شبكة معارف من الخبراء العالميين.
            ''',
        },
        {
            "img": "ship",
            "name": "الميناء وسلاسل الإمداد والخدمات اللوجستية",
            "description":
            '''      
                ستبني أوكساچون أول ميناء رقمي متقدم ومستدام حول العالم يتبنى تقنيات الجيل القادم،
                  وتتكامل فيه سلاسل الإمداد، والخدمات اللوجستية، ونظام لتوصيل البضائع بالقطار،
                    بما يعزز الربط والوصول إلى طرق التجارة العالمية. كما ستخدم منصتنا لسلاسل الإمداد 
                  سكان واقتصاد نيوم تحت مظلة شبكة موحدة على المستويين المادي والرقمي.
            ''',
        },
        {
            "img": "people",
            "name": "مجتمعات مزدهرة",
            "description":
            '''      
                تصمم أوكساچون نموذجاً جديداً للحياة الحضرية.
                  وبإعادة تعريف مفهوم المدن الصناعية التقليدية، فإن أمامنا فرصة تاريخية 
                  نبدأ فيها من الصفر لتطوير مجمعات وبناء مجتمعات متعددة الاستخدامات،
                    تتمحور حول الإنسان والابتكار والاستدامة.
            ''',
        },
    ]

    context = {"cards": cards}
    return render(request, "oxagon.html", context)


def investment_page(request: HttpRequest):
    return render(request, "investment.html")


def made_in_saudi_page(request: HttpRequest):

    cards = [
        {
            "img": "1-company-aided-by-saudi-made.png",
            "name": "+1,740",
            "description":
            '''      
                شركة تستفيد من البرنامج
            ''',
        },
        {
            "img": "2-saudi-made-logo-on-a-product.png",
            "name": "+7,600",
            "description":
            '''      
                 منتج يحمل شعار "صنع في السعودية"
            ''',
        },
        {
            "img": "3-sector-saudi-made.png",
            "name": "16",
            "description":
            '''      
                 قطاعًا يدخل في المبادرة
            ''',
        },
        {
            "img": "4-country-imorts-saudi-made-products.png",
            "name": "180",
            "description":
            '''      
                دولة تستورد منتجات "صنع في السعودية"
            ''',
        },
    ]
    context = {"cards": cards}

    return render(request, "made_in_saudi.html" ,context)


def contactus_page(request: HttpRequest):
    return render(request, "contactus.html")
