from django.shortcuts import redirect, render
from django.http import HttpRequest
from django.urls import reverse


def home_page(request: HttpRequest):

    return render(request, "index.html")


def mode_light(request: HttpRequest):

    response = redirect("main:home_page")
    response.set_cookie("mode", "False")

    return response


def mode_dark(request: HttpRequest):
    response = redirect("main:home_page")
    response.set_cookie("mode", "True")

    return response


def properties_page(request: HttpRequest):
    properties = [
        {
            "name": "الإستراتيجية الوطنية للتقنية الحيوية",
            "image": ["DNA.jpg", "biotech-side.png"],
            "description":
            '''
            تعزيزًا لمكانة المملكة كدولة رائدة في قطاع التقنية الحيوية، تجسد الاستراتيجية الوطنية للتقنية الحيوية،
            وتتسع آفاقها لتعبّر عن بداية رحلةٍ تحوليةٍ للمملكة وللعالم. 
            تستهدف الاستراتيجية أن تصبح المملكة تجمعاً عالمياً رائداً في مجال التقنية الحيوية،
            إلى جانب تحقيق مستوى عالٍ من الاكتفاء الذاتي وإحداث أثر اجتماعي واقتصادي إيجابي.
            ''',
            "url": reverse("main:nb_strategy"),
        },

        {
            "name": "نيوم",
            "image": ["neom_desktop-1.png"],
            "description": "في عام 2017 أطلق صاحب السمو الملكي الأمير محمد بن سلمان بن عبدالعزيز ولي العهد رئيس مجلس الوزراء مشروع نيوم الجريء الذي يقوده صندوق الاستثمارات العامة، ليحول الصحراء إلى مدينة مستقبلية مبتكرة في شمال غرب المملكة، تعمل بنسبة 100% بالطاقة المتجددة، لتكون نموذجًا جديدًا للحياة المستدامة والعمل والازدهار، حيث يمكن البشرية من التقدم دون المساس بصحة كوكب الأرض.",
            "url": reverse("main:nb_strategy"),
        },

        {
            "name": "أوكساجون",
            "image": ["oxagon.png"],
            "description": '''هي المدينة الساحلية الصناعية العائمة في نيوم، التي ستربطكم مباشرة بالأسواق العالمية.
            \nتبني أوكساچون منظومة صناعية متقدمة ونظيفة تراعي مبادئ الحفاظ على البيئة، وتسرّع التحول إلى الثورة الصناعية الرابعة ومبادئ الاقتصاد الدائري. أوكساچون هي فرصة جديدة تُبنى من الصفر لتغيير مفهوم المدن الصناعية التقليدية، وإنشاء نموذج جديد يتمحور حول الإنسان والابتكار و الاستدامة.''',
            "url": reverse("main:nb_strategy"),
        },

        {
            "name": "الاستراتيجية الوطنية للاستثمار",
            "image": ["kafd.png"],
            "description": '''
                تنمي الاستراتيجية الوطنية للاستثمار البيئة التنافسية السعودية وتصنع مستقبلًا أكثر إشراقًا للقطاعات الحيوية.
                   \n تسهم الاستراتيجية الوطنية للاستثمار التي أطلقها صاحب السمو الملكي الأمير محمد بن سلمان بن عبدالعزيز ولي العهد ورئيس مجلس الوزراء في دفع عجلة التنمية وتنويع الاقتصاد المحلي، حيث تستهدف زيادة مساهمة القطاع الخاص في الناتج المحلي الإجمالي، وجذب المزيد من الاستثمارات الأجنبية، وزيادة الصادرات غير النفطية، وتقليل البطالة، وتعزيز تصنيف المملكة بين أفضل عشرة اقتصادات في مؤشر التنافسية العالمية بحلول عام 2030.''',
            "url": reverse("main:nb_strategy"),
        },

        {
            "name": "صنع في السعودية",
            "image": ["saudi-contaner.png"],
            "description": '''
            يحفز برنامج "صنع في السعودية" الشركات المحلية على توسيع نطاق أعمالها، والاستفادة من مزايا البرنامج لتسويق منتجاتها إلى عدد أكبر من العملاء، والتواصل مع المستهلكين المهتمين بالمنتجات والشركات السعودية.
            ''',
            "url": reverse("main:nb_strategy"),
        },
    ]

    context = {"properties": properties}

    return render(request, "properties.html", context)


def national_biotechnology_strategy(request: HttpRequest):
    items = [
        {
            "img": "vaccine.png",
            "name": "1\n\nاللقاحات",
            "description":
            '''      
            تُعزز التقنية من إمكانيات التصنيع المتكاملة للقاحات،
             التي تسهم في تحقيق مستويات عالية من الاكتفاء الذاتي،
              إلى جانب تطوير فرص تفتح مجالًا أوسع للتصدير إلى منطقة الشرق الأوسط وشمال أفريقيا،
              وتمكين جهود البحث والتطوير باستخدام أحدث التقنيات المبتكرة؛
              لتُصبح المملكة مركزًا رائدًا في مجال التطوير النهائي للقاحات في المنطقة.
            ''',
        },
        {
            "img": "make.png",
            "name": "2\n\nالتصنيع الحيوي والتوطين",
            "description":
            '''
            تُمكّن التقنية من تحقيق كفاءة الإنفاق في الرعاية الصحية،
              بإنشاء منصة متكاملة للتصنيع الحيوي على المستوى المحلي؛
              بهدف الوصول إلى الاكتفاء الذاتي في إنتاج المستحضرات والمتشابهات الحيوية،
                وسيوفر ذلك فرصًا في لزيادة الصادرات النوعية، وتمكين نمو قطاع التقنية الحيوية.
            ''',
        },
        {
            "img": "vaccine.png",
            "name": "اللقاحات",
            "description":
            '''      
            تُعزز التقنية من إمكانيات التصنيع المتكاملة للقاحات،
             التي تسهم في تحقيق مستويات عالية من الاكتفاء الذاتي،
              إلى جانب تطوير فرص تفتح مجالًا أوسع للتصدير إلى منطقة الشرق الأوسط وشمال أفريقيا،
              وتمكين جهود البحث والتطوير باستخدام أحدث التقنيات المبتكرة؛
              لتُصبح المملكة مركزًا رائدًا في مجال التطوير النهائي للقاحات في المنطقة.
            ''',
        },
        {
            "img": "vaccine.png",
            "name": "اللقاحات",
            "description":
            '''      
            تُعزز التقنية من إمكانيات التصنيع المتكاملة للقاحات،
             التي تسهم في تحقيق مستويات عالية من الاكتفاء الذاتي،
              إلى جانب تطوير فرص تفتح مجالًا أوسع للتصدير إلى منطقة الشرق الأوسط وشمال أفريقيا،
              وتمكين جهود البحث والتطوير باستخدام أحدث التقنيات المبتكرة؛
              لتُصبح المملكة مركزًا رائدًا في مجال التطوير النهائي للقاحات في المنطقة.
            ''',
        },
    ]
    context = {"items": items}
    return render(request, "nb_strategy.html", context)


def contactus_page(request: HttpRequest):
    return render(request, "contactus.html")
